Tekla Open API Reference for Tekla Structures 2025
AnalysisLabel Properties
The AnalysisLabel type exposes the following members.
Properties
Name | Description
Number
 The number of the analysis label.
Prefix
 The prefix of the analysis label.
Top
See Also
Reference
AnalysisLabel Class
Tekla.Structures.Analysis Namespace